Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Added fat arrow functions.
ja: 太矢印の関数を追加しました。

source: Added CallbackFree(Address), to free the callback memory and release the associated function object.
ja: コールバックメモリを解放し、関連する関数オブジェクトを解放するためのCallbackFree(Address)を追加しました。

source: Added AutoHotkey syntax highlighting.
ja: AutoHotkeyのシンタックスハイライトを追加しました。

source: Added a workaround for the first shown menu not accepting keyboard input on Windows 10.
ja: Windows 10で最初に表示されるメニューがキーボード入力を受け付けない場合の回避策を追加しました。

source: Added support for multi-variable enumerators (for-loops) with IDispatch-wrapped AutoHotkey objects.
ja: IDispatchでラップされたAutoHotkeyオブジェクトで、多変数の列挙子（forループ）のサポートを追加しました。

source: Added:
ja: 追加：

source: Adding 4 ensures that DirSelect will work properly even in a Preinstallation Environment like WinPE or BartPE.
ja: 4を追加することで、WinPEやBartPEなどのプリインストール環境でも、DirSelectが正常に動作するようになります。

source: Adding &Open to the tray menu by calling AddStandard or changing A_AllowMainWindow also causes it to become the default item if there wasn't one already.
ja: AddStandardの呼び出しやA_AllowMainWindowの変更によってトレイメニューに&Openを追加すると、すでになかった場合はデフォルトのアイテムになることもあります。

source: Adding Properties and Methods
ja: プロパティとメソッドの追加

source: Adding a new class to the script is much less likely to affect the behaviour of any existing function, as classes are not super-global.
ja: クラスはスーパーグローバルではないので、スクリプトに新しいclassを追加しても、既存の関数の動作に影響を与える可能性ははるかに低くなります。

source: Adding the &Open item to the tray menu causes it to become the default item if there wasn't one already.
ja: トレイメニューに&Open項目を追加すると、その項目がまだない場合はデフォルトの項目となります。

source: Additional (higher-priority) criteria can be specified on the command line with the /RunWith launcher switch.
ja: 追加の（優先順位の高い）条件は、/RunWithlauncherスイッチを使ってコマンドラインで指定できる。

source: Additional (rarely-used) notifications can be detected by using OnNotify.
ja: OnNotifyを使用することで、追加の（ほとんど使用されない）通知を検出することができます。

source: Additional Information Available to the Function
ja: 機能で利用できる追加情報

source: Additional Options
ja: 追加オプション

source: Additional debugging features are supported via DBGp, a common debugger protocol for languages and debugger UI communication.
ja: 追加のデバッグ機能は、言語およびデバッガーUI通信用の一般的なデバッガープロトコルである DBGpを介してサポートされます。

source: Additional files can be included using compiler directives.
ja: コンパイラのディレクティブを使って、追加ファイルをインクルードすることができる。

source: Additional information is available by accessing the pcre_callout_block structure via A_EventInfo.
ja: 追加情報は、A_EventInfoを介してpcre_callout_block構造体にアクセスすることで得られます。

source: Additional lines may be returned in future.
ja: 今後、追加ラインが返される可能性もある。

source: Additional methods are defined for all values (except ComObjects):
ja: すべての値（ComObjectを除く）に対して、追加のメソッドが定義されています：

source: Additional methods are defined for all values (except ComObjects): GetMethod, HasProp, HasMethod.
ja: すべての値（ComObjectを除く）に対して、追加のメソッドが定義されています：GetMethod、HasProp、HasMethod。

source: Additional notes:
ja: 追記：

source: Additional settings can be accessed via the settings button at the bottom-left of the GUI:
ja: その他の設定は、GUI の左下にある設定ボタンからアクセスできます：

source: Additional settings control how the launcher selects which interpreter to use.
ja: 追加の設定は、ランチャーがどのインタープリターを使用するかを選択する方法を制御します。

source: Additionally in the case of a failure, Ahk2Exe has exit codes indicating the kind of error that occurred.
ja: さらに失敗した場合、Ahk2Exeは発生したエラーの種類を示す終了コードを持っています。

source: Additionally, for a list of all/most hotkey names that can be used on the left side of a hotkey's double-colon, see List of Keys, Mouse Buttons, and Controller Controls.
ja: また、ホットキーのダブルコロンの左側で使用できるホットキー名の一覧については、「キー、マウスボタン、コントローラーコントロールの一覧」を参照してください。

source: Additionally, performance may be reduced by a few percent while line logging is enabled.
ja: また、ラインロギングを有効にしている間は、パフォーマンスが数％低下する場合があります。

source: Additionally, some special characters may need to be escaped or enclosed in braces, depending on the context.
ja: さらに、コンテキストによっては、一部の特殊文字をエスケープするか、中括弧で囲む必要があります。

source: Additionally, strings stored in variables are treated no differently from literal strings.
ja: また、変数に格納された文字列は、リテラル文字列と同じように扱われます。

source: Adds a Help button (see remarks below)
ja: ヘルプボタンを追加します（下記備考参照）

source: Adds a checkmark if there wasn't one; otherwise, removes it.
ja: チェックマークがない場合は追加し、それ以外の場合は削除します。

source: Adds a control to the GUI window, and returns a GuiControl object.
ja: GUIウィンドウにコントロールを追加し、GuiControlオブジェクトを返します。

source: Adds a new item to the TreeView and returns its unique Item ID number (or 0 upon failure).
ja: TreeViewに新しいアイテムを追加し、そのユニークなアイテムID番号（失敗した場合は0）を返します。

source: Adds a new item to the TreeView.
ja: TreeViewに新しいアイテムを追加します。

source: Adds a new menu item to the bottom of the tray icon menu.
ja: トレイアイコンメニューの下部に新しいメニュー項目を追加します。

source: Adds a new row to the bottom of the list, and returns the new row number, which is not necessarily the last row if the ListView has the Sort or SortDesc style.
ja: リストの一番下に新しい行を追加し、新しい行番号を返します。この行番号は、ListViewがSortまたはSortDescスタイルを持つ場合、必ずしも最後の行とは限りません。

source: Adds a new row to the bottom of the list.
ja: リストの一番下に新しい行を追加します。

source: Adds a resource to the .exe.
ja: .exe にリソースを追加する。

source: Adds a resource to the compiled executable.
ja: コンパイル済みの実行ファイルにリソースを追加する。

source: Adds a visible checkmark in the menu next to MenuItemName (if there isn't one already).
ja: メニューのMenuItemNameの隣に、目に見えるチェックマークを追加します（まだチェックマークがない場合）。

source: Adds a visible checkmark next to a menu item.
ja: メニューの横に、目に見えるチェックマークを付けます。

source: Adds a window specification to a window group, creating the group if necessary.
ja: ウィンドウの仕様をウィンドウグループに追加し、必要に応じてグループを作成します。

source: Adds an icon or picture to the specified ImageList, and returns the new icon's index (1 is the first icon, 2 is the second, and so on).
ja: 指定された ImageList にアイコンまたは画像を追加し、新しいアイコンのインデックスを返します（1 は最初のアイコン、2 は 2 番目のアイコン、といった具合に）。

source: Adds or modifies a menu item.
ja: メニュー項目を追加または変更します。

source: Adds or removes various options and styles of the control.
ja: コントロールの各種オプションやスタイルを追加・削除します。

source: Adds or subtracts 1 from a variable.
ja: 変数に 1 を加算または減算する。

source: Adds or subtracts time from a date-time value.
ja: 日付時刻の値から時間を加算または減算します。

source: Adds the specified string as a new entry at the bottom of a ListBox or ComboBox.
ja: リストボックスまたはコンボボックスの下部に、指定された文字列を新規項目として追加します。

source: Adds the standard tray menu items.
ja: 標準トレイのメニュー項目を追加します。

source: Adds the template name to a list of templates that will not be shown in the GUI.
ja: GUIに表示されないテンプレートのリストにテンプレート名を追加します。

source: Adjusts the bitmap to fit the size of the control.
ja: コントロールのサイズに合わせてビットマップを調整する。

source: Adjusts the column's width to fit its contents and the column's header text, whichever is wider.
ja: カラムの幅を、そのコンテンツとカラムのヘッダーテキストのどちらか広い方に合うように調整します。

source: Adjusts the column's width to fit its contents.
ja: カラムの内容に合わせて、カラムの幅を調整します。

source: Advanced Buttons
ja: 高度なボタン

source: Advanced Details
ja: 詳細

source: Advanced Hotkey Features
ja: 高度なホットキー機能

source: Advanced Hotkey Features | AutoHotkey v2
ja: 高度なホットキー機能｜AutoHotkey v2

source: Advances the file pointer.
ja: ファイルポインタを前進させる。

source: Advantages:
ja: メリット：

source: Affects CaretGetPos.
ja: CaretGetPosに影響を与えます。

source: Affects MouseGetPos, Click, and MouseMove/Click/Drag.
ja: MouseGetPos、Click、MouseMove/Click/Dragに影響します。

source: Affects PixelGetColor, PixelSearch, and ImageSearch.
ja: PixelGetColor、PixelSearch、ImageSearchに影響します。

source: Affects ToolTip.
ja: ToolTipに影響します。

source: Affects the Menu.Show method when coordinates are specified for it.
ja: Menu.Showメソッドに座標が指定されている場合、その座標に影響します。

source: Affects the behavior of Send with hotkey modifiers:
ja: ホットキー修飾子を持つSendの動作に影響します。

source: African
ja: アフリカ語

source: After WinActivate's first failed attempt, it automatically sends {Alt up}.
ja: WinActivateの最初の試みが失敗すると、自動的に{Alt up}が送信される。

source: After a column is sorted -- either by means of the user clicking its header or the script calling LV.ModifyCol(1, "Sort") -- any subsequently added rows will appear at the bottom of the list rather than obeying the sort order.
ja: カラムがソートされた後（ユーザーがヘッダーをクリックするか、スクリプトがLV.ModifyCol(1, "Sort")を呼び出す）、その後に追加された行は、ソート順序に従わずにリストの一番下に表示されます。

source: After a row is added, its row number tends to change due to sorting, deleting, and inserting of other rows.
ja: 行が追加された後、他の行のソート、削除、挿入により、その行番号は変化する傾向があります。

source: After applying certain style changes to a visible window, it might be necessary to redraw the window using WinRedraw.
ja: 特定のスタイル変更を可視ウィンドウに適用した後、WinRedrawを使用してウィンドウを再描画する必要がある場合があります。

source: After being edited, an item can be alphabetically repositioned among its siblings via the following example:
ja: 編集後の項目は、次の例に従って、その兄弟の中でアルファベット順に再配置することができます：

source: After copying the function into a script or saving it as SendSuppressedKeyUp.ahk in a Lib folder and adding #Include <SendSuppressedKeyUp> to the script, it can be used as follows:
ja: この関数をスクリプトにコピーするか、LibフォルダにSendSuppressedKeyUp.ahkとして保存し、スクリプトに#Include <SendSuppressedKeyUp>を追加すると、次のように使えるようになります：

source: After creating the default script, launch AutoHotkey via the shortcut in the Start menu to run it.
ja: デフォルトのスクリプトを作成したら、スタートメニューのショートカットからAutoHotkeyを起動して実行します。

source: After downloading it, you may possibly need to install it.
ja: ダウンロードしたら、インストールしましょう。

source: After editing a script, you must run or reload the script for the changes to take effect.
ja: スクリプトを編集した後、変更を有効にするには、スクリプトを実行するか再読み込みする必要があります。

source: After sending all the keys, the function doesn't know whether it can safely push back down Ctrl and Alt (to match whether the user is still holding them down).
ja: すべてのキーを送信した後、関数はCtrlと Altを安全に押し戻せるかどうか（ユーザーがまだ押し続けているかどうかを確認するため）わからない。

source: After that, address must be considered invalid.
ja: それ以降のアドレスは無効とみなされる。

source: After that, Notepad will be closed and a message box will be shown if it did not close within 5 seconds.
ja: その後、メモ帳は閉じられ、5秒以内に閉じられなかった場合はメッセージボックスが表示されます。

source: After that, an attempt is made to close the process within 5 seconds.
ja: その後、5秒以内にプロセスを閉じるよう試みます。

source: After that, press the Win+Space hotkey.
ja: その後、Win+Spaceのホットキーを押してください。

source: After that, the text file and its properties dialog will be opened.
ja: その後、テキストファイルとそのプロパティダイアログが開かれます。

source: After the Run function retrieves a PID, any windows to be created by the process might not exist yet.
ja: Run関数がPIDを取得した後、プロセスによって作成されるウィンドウは、まだ存在しないかもしれません。

source: After the function returns, the new value is assigned back to the object's Ptr property.
ja: 関数が戻った後、新しい値はオブジェクトのPtrプロパティに再び割り当てられます。

source: After the script has been loaded, the auto-execute thread begins executing at the script's top line, and continues until instructed to stop, such as by Return, ExitApp or Exit.
ja: スクリプトが読み込まれた後、自動実行スレッドは、スクリプトの先頭行で実行を開始し、Return、ExitApp、Exitなどの停止指示があるまで実行を続ける。

source: After the timeout has elapsed, the input box will be automatically closed and Result will be set to word "Timeout".
ja: タイムアウト後は、入力ボックスは自動的に閉じられ、Resultには"Timeout"という文字が表示されます。

source: After the timeout has elapsed, the input box will be automatically closed and InputBoxObj.Result will be set to the word Timeout.
ja: タイムアウトになるとインプットボックスは自動的に閉じられ、InputBoxObj.ResultにはTimeoutという文字が設定されます。

source: After you've started the script, changes to the script's file do not take effect automatically.
ja: スクリプトを起動した後、スクリプトのファイルを変更しても、自動的に反映されることはありません。

source: Ahk2Exe can be used in the following ways:
ja: Ahk2Exeは次のような使い方ができます：

source: Ahk2Exe fills the binary version fields with the period-delimited numbers (up to four) that may appear at the beginning of the version text.
ja: Ahk2Exe はバイナリのバージョンフィールドに、バージョンテキストの先頭に表示されるピリオドで区切られた数字（最大4つ）を入力します。

source: Ahk2Exe optionally uses MPRESS or UPX freeware to compress compiled scripts.
ja: Ahk2Exeはコンパイルされたスクリプトを圧縮するためにMPRESSまたはUPXフリーウェアをオプションで使用します。

source: Alignment options:
ja: アライメントオプションです：

source: All .exe files that are included must have a name starting with AutoHotkey and a file description containing the word AutoHotkey, and must have a version of 1.1.34+ or 2.0-a135+.
ja: 含まれるすべての.exeファイルは、AutoHotkeyで始まる名前と、AutoHotkeyという単語を含むファイル説明が必要で、バージョンは1.1.34+または2.0-a135+でなければなりません。

source: All global variables.
ja: すべてのグローバル変数。

source: All Edit controls have at least 1 line, even if the control is empty.
ja: すべてのEditコントロールは、コントロールが空であっても少なくとも1行を持ちます。

source: All GUI windows are automatically destroyed when the script exits.
ja: スクリプトが終了すると、すべてのGUIウィンドウは自動的に破棄されます。

source: All Windows systems should be able to play .wav files.
ja: すべてのWindowsシステムは.wavファイルを再生できるはずだ。

source: All array elements are copied to the new array.
ja: 配列の全要素が新しい配列にコピーされます。

source: All built-in "virtual" variables now have the A_ prefix (specifics below).
ja: すべての組み込み「仮想」変数の接頭辞がA_になりました（詳細は下記）。

source: All built-in functions that accept a WinText parameter are affected by this setting, including WinActivate, WinActive, WinWait, and WinExist.
ja: WinTextパラメータを受け付けるすべての組み込み関数（WinActivate、WinActive、WinWait、WinExistを含む）は、この設定の影響を受けます。

source: All built-in methods and properties (including base) are defined the same way as if user-defined.
ja: すべての組み込みメソッドとプロパティ（baseを含む）は、ユーザー定義と同じ方法で定義されます。

source: All built-in variables are valid, except for A_Args and built-in classes.
ja: A_Argsと、組み込みクラスを除く、すべての組込変数が有効です。

source: All compiler directives are introduced by the string @Ahk2Exe-, preceded by the comment flag (usually ;).
ja: すべてのコンパイラディレクティブは@Ahk2Exe-という文字列で始まり、その前にコメントフラグ (通常は;) が付きます。

source: All control flow statements also accept expressions, except where noted below.
ja: 以下に記す場合を除き、すべての制御フロー文は式も受け付けます。

source: All control flow statements which take parameters (currently excluding the two-word Loop statements) support parentheses around their parameter list, without any space between the name and parenthesis.
ja: パラメータを取るすべての制御フロー文（現在、2語のLoop文を除く）は、パラメータリストを括弧で囲み、名前と括弧の間にスペースを入れずにサポートします。

source: All controls except Edit and MonthCal (and the Edit control within a ComboBox), which have their own standard context menu.
ja: EditとMonthCal（およびComboBox内のEditコントロール）以外のすべてのコントロールは、独自の標準コンテキストメニューを持っています。

source: All controls which supported "Gui Color" now support +BackgroundColor and +BackgroundDefault (synonymous with -Background), not just ListView/TreeView/StatusBar/Progress.
ja: ListView/TreeView/StatusBar/Progressだけでなく、「Gui Color」をサポートしていたすべてのコントロールが+BackgroundColorと +BackgroundDefault （-Backgroundと同義）をサポートしました。

source: All former commands are now functions (excluding control flow statements).
ja: 以前のコマンドはすべて関数になりました（制御フロー文は除きます）。

source: All functions can be called without parentheses if the return value is not needed (but as before, parentheses cannot be omitted for calls within an expression).
ja: 戻り値が不要な場合は、すべての関数を括弧なしで呼び出すことができます（ただし、従来通り、式内の呼び出しでは括弧を省略できません）。

source: All have volume and mute controls, except the fourth component, which only has volume.
ja: 第4のコンポーネントを除き、すべてにボリュームとミュートのコントロールがある。

source: All hotkey subroutines between here and the next #MaxThreadsBuffer False directive will buffer rather than ignore presses of their hotkeys whenever their subroutines are at their #MaxThreadsPerHotkey limit.
ja: ここから次の#MaxThreadsBuffer False指令までのすべてのホットキーサブルーチンは、そのサブルーチンが#MaxThreadsPerHotkeyの限界に達したときに、ホットキーの押下を無視するのではなく、バッファリングします。

source: All in one big happy script file.
ja: すべて1つの大きな幸せなスクリプトファイルだ。

source: All input generated by AutoHotkey scripts is excluded.
ja: AutoHotkeyスクリプトによって生成されたすべての入力は除外されます。

source: All instances of Object are based on Object.Prototype, which is based on Any.Prototype.
ja: ObjectのインスタンスはすべてObject.Prototypeに基づいており、これはAny.Prototypeに基づいている。

source: All integers and floating-point input values are 64-bit.
ja: 整数と浮動小数点の入力値は、すべて64ビットです。

source: All interrupted, paused, and newly launched threads are affected, including Timers.
ja: タイマーを含め、中断されたスレッド、一時停止されたスレッド、新しく起動されたスレッドすべてが影響を受けます。

source: All items must be within the client area.
ja: すべてのアイテムはクライアントエリア内にあること。

source: All key-value pairs are copied to the new map.
ja: すべてのキーとバリューのペアが新しいマップにコピーされます。

source: All literal numbers are converted to pure binary numbers at load time and their string representation is discarded.
ja: すべてのリテラル数値は、ロード時に純粋な2進数に変換され、その文字列表現は破棄されます。

source: All loop sub-commands now support OTB.
ja: すべてのループサブコマンドがOTBに対応しました。

source: All matching files are retrieved, including hidden files.
ja: 隠しファイルを含め、一致するすべてのファイルを取得します。

source: All methods and dynamic properties that apply to instances of the class are contained by the prototype object.
ja: クラスのインスタンスに適用されるすべてのメソッドとダイナミック・プロパティは、プロトタイプ・オブジェクトに含まれている。

source: All non-static method and property definitions inside the class body are attached to the prototype object.
ja: クラス本体内の非静的なメソッドやプロパティ定義は、すべてプロトタイプオブジェクトにアタッチされます。

source: All numbers within the specified range have approximately the same probability of being generated.
ja: 指定された範囲内のすべての数値は、ほぼ同じ確率で生成されます。

source: All of the above allow N to be any of the following:
ja: 以上のことから、Nは以下のいずれかになることができます：

source: All of the following are equivalent:
ja: 以下はすべて同等です：

source: All of the following are valid:
ja: 以下のすべてが有効です：

source: All of the following yield temporary strings:
ja: 以下はすべて、一時的な文字列が得られる：

source: All options are supported except DPS`r`n`a.
ja: DPS`r`n`aを除くすべてのオプションがサポートされている。

source: All other comparison operators except ~= compare only up to the first binary zero.
ja: ~=以外の比較演算子は、最初の2進数の0までしか比較しない。

source: All other controls are supported only indirectly, through SoundGetInterface and ComCall.
ja: その他のコントロールは、SoundGetInterfaceと ComCallを通じて間接的にのみサポートされる。

source: All other parameters are expressions.
ja: その他のパラメータはすべて式です。

source: All other threads default to creating or modifying global hotkeys, unless that default is overridden by using HotIf during script startup.
ja: 他のすべてのスレッドは、スクリプトの起動時にHotIfを使用してデフォルトが上書きされない限り、グローバルホットキーの作成または変更をデフォルトとします。

source: All other threads default to the last setting used by the auto-execute section, which itself defaults to no criterion (global hotkeys).
ja: 他のすべてのスレッドは、自動実行セクションで使用される最後の設定がデフォルトで、それ自体は基準なしがデフォルトです（グローバルホットキー）。

source: All other types are a sub-type of Any.
ja: それ以外のタイプは、Anyのサブタイプになります。

source: All other types are legal.
ja: それ以外のタイプはすべて合法です。

source: All other variables are set according to their definitions above.
ja: その他の変数は、上記の定義に従って設定される。

source: All parameters are expressions, so all text is "quoted" and commas never need to be escaped.
ja: すべてのパラメータは式なので、すべてのテキストは「引用」され、カンマをエスケープする必要はありません。

source: All parameters are optional, except that there must be one /gui or /in parameter.
ja: /guiまたは/inパラメータが1つなければならないことを除いて、すべてのパラメータはオプションである。

source: All parameters passed to Call are forwarded on to __New.
ja: Callに渡された全てのパラメータは、__Newに転送されます。

source: All strings are treated as replacement text.
ja: すべての文字列が置換テキストとして扱われます。

source: All subfolders will be recursed into, not just those whose names match FilePattern.
ja: FilePatternに一致する名前のサブフォルダだけでなく、すべてのサブフォルダに再帰的にアクセスします。

source: All tabs are the same width.
ja: すべてのタブの幅は同じです。

source: All threads use the default priority unless changed by one of the following methods:
ja: 以下のいずれかの方法で変更しない限り、すべてのスレッドはデフォルトの優先順位を使用する：

source: All three BlockInput modes (OnOff, SendMouse and MouseMove) operate independently of each other.
ja: BlockInputの3つのモード（OnOff、SendMouse、MouseMove）は、それぞれ独立して動作します。

source: All vkNNscNNN sequences and all non-zero vkNN or scNNN sequences are permitted, but some combinations may fail to suppress the menu.
ja: すべてのvkNNscNNN配列と、ゼロでないすべてのvkNNまたはscNNN配列が許容されるが、組み合わせによっては、メニューの抑制に失敗することがある。

source: All windowing functions can operate upon a window group by specifying ahk_group MyGroupName for the WinTitle parameter.
ja: WinTitleパラメータにahk_group MyGroupNameを指定することで、すべてのウィンドウ関数がウィンドウグループに対して操作できるようになります。

source: All windowing functions except WinShow are affected by this setting, including WinActivate, WinActive, WinWait and WinExist.
ja: WinShowを除くすべてのウィンドウ機能（WinActivate、WinActive、WinWait、WinExistなど）がこの設定の影響を受けます。

source: Allocate a Buffer to hold a specific number of characters.
ja: 特定の文字数を保持するBufferを確保します。

source: Allocate memory and initialize the binary structure of the object, which depends on the object's native type (e.g. whether it is an Array or Map, or just an Object).
ja: メモリを確保し、オブジェクトのバイナリ構造を初期化します。これは、オブジェクトのネイティブタイプ（例えば、配列かマップか、あるいは単なるオブジェクトか）に依存します。

source: Allocates or reallocates the buffer and optionally fills it.
ja: バッファの割り当てまたは再割り当てを行い、オプションでバッファを埋めます。

source: Allow error handling to proceed as normal.
ja: エラー処理を通常通り行うことができるようにします。

source: Allow the debugger engine to report a language other than "php".
ja: デバッガーエンジンが「php」以外の言語を報告できるようにします。

source: Allows semicolon comments inside the continuation section (but not /*..*/).
ja: 継続セクション内でのセミコロン・コメントを許可する（ただし/*..*/は不可）。

source: Allows a maximum of 2 instead of 10 simultaneous threads.
ja: 最大10スレッドではなく、最大2スレッドを可能にします。

source: Allows a maximum of 200 hotkeys to be pressed within 2000 ms without triggering a warning dialog.
ja: 警告ダイアログをトリガーすることなく、2000ms以内に最大200個のホットキーを押すことを許可します。

source: Allows a maximum of 3 simultaneous threads instead of 1 per hotkey or hotstring.
ja: 1つのホットキーまたはホットストリングにつき1つのスレッドではなく、最大3つのスレッドを同時に使用できるようにします。

source: Allows duplicate named subpatterns.
ja: 名前付きサブパターンの重複を許可する。

source: Allows images to be displayed for fields beyond the first.
ja: 最初のフィールド以外のフィールドに画像を表示できるようにする。

source: Allows multiple selections via control-click and shift-click.
ja: コントロール・クリックとシフト・クリックによる複数選択が可能。

source: Allows the owner to parse user input and take necessary action.
ja: オーナーがユーザーの入力を解析し、必要なアクションを取ることを許可する。

source: Allows the script to call properties and methods of the object using normal object syntax.
ja: 通常のオブジェクトの構文を使用して、スクリプトがオブジェクトのプロパティやメソッドを呼び出せるようにします。

source: Allows the thumb's size to be changed.
ja: 親指のサイズを変更できるようにする。

source: Allows the user to edit the names of tree-view items.
ja: ツリービューの項目名を編集できるようにする。

source: Allows the user to enter a hidden password.
ja: 隠しパスワードの入力を許可します。

source: Allows the user to enter a phone number.
ja: 電話番号の入力を許可します。

source: Allows the user to move the caret around to see its current position displayed in an auto-update tooltip.
ja: キャレットを移動させ、自動更新のツールチップに表示される現在位置を確認できるようにします。

source: Allows the user to move the mouse cursor.
ja: マウスカーソルの移動を許可します。

source: Allows the user to once again select MenuItemName if it was previously disabled (grayed).
ja: MenuItemNameが無効（グレー表示）になっている場合、再度選択できるようにします。

source: Allows the user to once again select a menu item if was previously disabled (grayed).
ja: グレー表示になっているメニューを再度選択できるようにします。

source: Allows the user to press ↑ or ↓ on the keyboard to increase or decrease the UpDown control's position.
ja: キーボードの↑または↓を押して、UpDownコントロールの位置を増減できる。

source: Allows the user to select a drive in order to analyze it.
ja: 解析するドライブを選択できるようにします。

source: Allows the user to select a folder and provides both an edit field and a "make new folder" button.
ja: ユーザーがフォルダを選択し、編集フィールドと「新しいフォルダを作る」ボタンの両方を提供します。

source: Allows the user to select a folder in the "My Computer" directory.
ja: マイコンピュータディレクトリ内のフォルダを選択できるようにします。

source: Allows the user to select a folder.
ja: フォルダーを選択できるようにします。

source: Allows the user to select a range of dates rather than being limited to a single date.
ja: ユーザーが単一の日付に制限されるのではなく、日付の範囲を選択できるようにします。

source: Allows the user to select an .lnk file to show its information.
ja: .lnkファイルを選択し、その情報を表示できるようにします。

source: Allows the user to select an existing .txt or .doc file.
ja: 既存の.txtまたは.docファイルを選択できるようにします。

source: Allows the user to select multiple existing files.
ja: 既存のファイルを複数選択できるようにします。

source: Allows the volume to be adjusted by scrolling the mouse wheel over the taskbar.
ja: タスクバー上でマウスホイールをスクロールして音量を調整できるようにします。

source: Allows to iterate through the GUI's controls.
ja: GUIのコントロールを繰り返し使用できるようにします。

source: Allows windowing functions to possibly detect more control types, but with lower performance.
ja: ウィンドウ関数がより多くのコントロールタイプを検出できるようになるが、パフォーマンスは低下する。
